In [26]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [14]:
np.random.seed(101)

In [5]:
labels = ["a","b","c"]
my_data = [10,20,30]
arr = np.array(my_data)
d = {"a":10,"b":20,"c":30}

In [10]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(data=labels, index=my_data)

10    a
20    b
30    c
dtype: object

In [93]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["F","G","H","I"])

In [94]:
df

          F         G         H         I
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [32]:
df.F

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: F, dtype: float64

In [29]:
df["F"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: F, dtype: float64

In [31]:
type(df["F"])

pandas.core.series.Series

In [33]:
df[["G","H"]]

          G         H
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [35]:
df["new"]=df["G"]+df["H"]

In [82]:
df

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [38]:
df.drop("F",axis=1)

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [39]:
df

          F         G         H         I       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [40]:
df.drop("F",axis=1,inplace=True)

In [41]:
df

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [42]:
df.drop("E")

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109

In [43]:
df

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [47]:
df.loc["A"]

G      0.628133
H      0.907969
I      0.503826
new    1.536102
Name: A, dtype: float64

In [50]:
df.iloc[0]

G      0.628133
H      0.907969
I      0.503826
new    1.536102
Name: A, dtype: float64

In [52]:
df.loc["C","H"]

0.5288134940893595

In [53]:
df.shape

(5, 4)

In [54]:
df

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [55]:
df.loc[["B","D"],["G","I"]]

          G         I
B -0.319318  0.605965
D -0.758872  0.955057

In [56]:
df>0

       G      H      I    new
A   True   True   True   True
B  False  False   True  False
C   True   True  False   True
D  False  False   True  False
E   True   True   True   True

In [61]:
G = df[df["G"]>0]

In [64]:
G["H"]

A    0.907969
C    0.528813
E    2.605967
Name: H, dtype: float64

In [65]:
df

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [75]:
df[df["H"]>0][["G","I"]]

          G         I
A  0.628133  0.503826
C  0.740122 -0.589001
E  1.978757  0.683509

In [86]:
df[(df["G"]>0) & (df["I"]>0)]
# use & and | to apply multiple conditions

          F         G         H         I
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [85]:
df

          F         G         H         I
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [90]:
df.reset_index(inplace=True)

In [91]:
df

   level_0 index         F         G         H         I
0        0     A  0.302665  1.693723 -1.706086 -1.159119
1        1     B -0.134841  0.390528  0.166905  0.184502
2        2     C  0.807706  0.072960  0.638787  0.329646
3        3     D -0.497104 -0.754070 -0.943406  0.484752
4        4     E -0.116773  1.901755  0.238127  1.996652

In [95]:
new_index= "NY CA OR NJ CO".split()

In [96]:
new_index

['NY', 'CA', 'OR', 'NJ', 'CO']

In [97]:
df["State"]=new_index

In [98]:
df

          F         G         H         I State
A -0.993263  0.196800 -1.136645  0.000366    NY
B  1.025984 -0.156598 -0.031579  0.649826    CA
C  2.154846 -0.610259 -0.755325 -0.346419    OR
D  0.147027 -0.479448  0.558769  1.024810    NJ
E -0.925874  1.862864 -1.133817  0.610478    CO

In [99]:
df.set_index("State")

              F         G         H         I
State
NY    -0.993263  0.196800 -1.136645  0.000366
CA     1.025984 -0.156598 -0.031579  0.649826
OR     2.154846 -0.610259 -0.755325 -0.346419
NJ     0.147027 -0.479448  0.558769  1.024810
CO    -0.925874  1.862864 -1.133817  0.610478

In [100]:
df

          F         G         H         I State
A -0.993263  0.196800 -1.136645  0.000366    NY
B  1.025984 -0.156598 -0.031579  0.649826    CA
C  2.154846 -0.610259 -0.755325 -0.346419    OR
D  0.147027 -0.479448  0.558769  1.024810    NJ
E -0.925874  1.862864 -1.133817  0.610478    CO